{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "bos_token_id": null,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_dim": 3072,
  "id2label": {
    "0": "header",
    "1": "entry",
    "2": "c-entry",
    "3": "info",
    "4": "remove"
  },
  "initializer_range": 0.02,
  "label2id": {
    "c-entry": 2,
    "entry": 1,
    "header": 0,
    "info": 3,
    "remove": 4
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "tie_word_embeddings": true,
  "transformers_version": "5.8.0",
  "use_cache": false,
  "vocab_size": 30522
}
